anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
void clearReportQueue() {
    portENTER_CRITICAL(&nimbleObserver.lock);
    nimbleObserver.readIndex = 0U;
    nimbleObserver.writeIndex = 0U;
    nimbleObserver.queued = 0U;
    nimbleObserver.reportsObserved = 0U;
    nimbleObserver.queueDrops = 0U;
    portEXIT_CRITICAL(&nimbleObserver.lock);
}

bool popReport(RawAdvertisement* report) {
    if (report == nullptr) return false;
    bool available = false;
    portENTER_CRITICAL(&nimbleObserver.lock);
    if (nimbleObserver.queued != 0U) {
        *report = nimbleObserver.queue[nimbleObserver.readIndex];
        nimbleObserver.readIndex =
            (nimbleObserver.readIndex + 1U) %
            NimbleObserverState::kQueueCapacity;
        --nimbleObserver.queued;
        available = true;
    }
    portEXIT_CRITICAL(&nimbleObserver.lock);
    return available;
}

std::uint16_t takeQueueDrops() {
    portENTER_CRITICAL(&nimbleObserver.lock);
    const std::uint16_t drops = nimbleObserver.queueDrops;
    nimbleObserver.queueDrops = 0U;
    portEXIT_CRITICAL(&nimbleObserver.lock);
    return drops;
}

std::uint16_t takeReportsObserved() {
    portENTER_CRITICAL(&nimbleObserver.lock);
    const std::uint16_t observed = nimbleObserver.reportsObserved;
    nimbleObserver.reportsObserved = 0U;
    portEXIT_CRITICAL(&nimbleObserver.lock);
    return observed;
}

void queueReport(const RawAdvertisement& report) {
    portENTER_CRITICAL(&nimbleObserver.lock);
    if (nimbleObserver.acceptingReports) {
        if (nimbleObserver.reportsObserved != UINT16_MAX) {
            ++nimbleObserver.reportsObserved;
        }
        if (nimbleObserver.queued < NimbleObserverState::kQueueCapacity) {
            nimbleObserver.queue[nimbleObserver.writeIndex] = report;
            nimbleObserver.writeIndex =
                (nimbleObserver.writeIndex + 1U) %
                NimbleObserverState::kQueueCapacity;
            ++nimbleObserver.queued;
        } else if (nimbleObserver.queueDrops != UINT16_MAX) {
            ++nimbleObserver.queueDrops;
        }
    }
    portEXIT_CRITICAL(&nimbleObserver.lock);
}

std::uint16_t scanUnits(std::uint16_t milliseconds) {
    return static_cast<std::uint16_t>(
        (static_cast<std::uint32_t>(milliseconds) * 1000U) / 625U);
}

void setAcceptingReports(bool accepting) {
    portENTER_CRITICAL(&nimbleObserver.lock);
    nimbleObserver.acceptingReports = accepting;
    portEXIT_CRITICAL(&nimbleObserver.lock);
}

int handleNimbleGapEvent(struct ble_gap_event* event, void*) {
    if (event == nullptr || event->type != BLE_GAP_EVENT_DISC) return 0;
    const ble_gap_disc_desc& source = event->disc;
    RawAdvertisement report;
    report.addressType = source.addr.type;
    report.eventType = source.event_type;
    std::copy_n(source.addr.val, report.address.size(),
                report.address.begin());
    report.payloadLength = static_cast<std::uint8_t>(
        std::min<std::size_t>(source.length_data, report.payload.size()));
    if (source.data != nullptr && report.payloadLength != 0U) {
        std::copy_n(source.data, report.payloadLength,
                    report.payload.begin());
    }
    report.rssiDbm = source.rssi;
    queueReport(report);
    return 0;
}

bool startPassiveScan(const drivers::ble::BleScanPlan& plan) {
    ble_gap_disc_params parameters{};
    parameters.itvl = scanUnits(plan.intervalMs);
    parameters.window = scanUnits(plan.windowMs);
    parameters.filter_policy = 0U;
    parameters.limited = 0U;
    parameters.passive = 1U;  // passive scan: never transmit scan requests
    parameters.filter_duplicates = 0U;
    parameters.disable_observer_mode = 0U;
    return ble_gap_disc(BLE_OWN_ADDR_PUBLIC, BLE_HS_FOREVER, &parameters,
                        handleNimbleGapEvent, nullptr) == 0;
}

bool stopPassiveScan() {
    const int result = ble_gap_disc_cancel();
    return result == 0 || result == BLE_HS_EALREADY;
}

void processAdvertisement(const RawAdvertisement& source,
                          RawScanContext* context) {
    if (context == nullptr || context->result == nullptr ||
        context->visitor == nullptr) {
        return;
    }
    std::array<std::uint8_t, 6> canonicalAddress{};
    std::reverse_copy(source.address.begin(), source.address.end(),
                      canonicalAddress.begin());
    if (context->deduplicateAddresses) {
        for (std::uint16_t index = 0; index < context->seenCount; ++index) {
            if (context->seenAddresses[index] == canonicalAddress) return;
        }
        if (context->seenCount >= context->seenAddresses.size()) {
            increment(&context->result->dropped);
            return;
        }
        context->seenAddresses[context->seenCount++] = canonicalAddress;
    }
    increment(&context->result->recordsReported);
    if (context->result->recordsRead >= context->maximumRecords) {
        increment(&context->result->dropped);
        return;
    }

    drivers::ble::BleAdvertisementRecord record;
    record.address = canonicalAddress;
    record.addressType = source.addressType;
    record.rssiDbm = source.rssiDbm;
    parseAdvertisementPayload(source, &record.name, &record.nameLength,
                              &record.advertisement);
    increment(&context->result->recordsRead);
    switch (context->visitor(
        record, static_cast<std::uint64_t>(esp_timer_get_time()),
        context->visitorContext)) {
        case BleRecordDisposition::Accepted:
            increment(&context->result->accepted);
            break;
        case BleRecordDisposition::Rejected:
            increment(&context->result->rejected);
            break;
        case BleRecordDisposition::Dropped:
            increment(&context->result->dropped);
            break;
    }
}

void drainReports(RawScanContext* context) {
    RawAdvertisement report;
    while (popReport(&report)) processAdvertisement(report, context);
    const std::uint16_t observed = takeReportsObserved();
    const std::uint16_t queueDrops = takeQueueDrops();
    if (context == nullptr || context->result == nullptr) return;
    for (std::uint16_t index = 0U; index < observed; ++index) {
        increment(&context->result->recordsObserved);
    }
    for (std::uint16_t index = 0U; index < queueDrops; ++index) {
        increment(&context->result->dropped);
    }
}

void handleNimbleReset(int) {
    processNimbleSynced = false;
    processControllerAvailable = false;
}

void handleNimbleSync() {
    processNimbleSynced = true;
}

