anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
void runProcessNimbleHost(void*) {
    processNimbleHostRunning = true;
    nimble_port_run();
    processNimbleSynced = false;
    processControllerAvailable = false;
    // The FreeRTOS port deinitializer deletes the current host task and is not
    // required to return. Publish the exit path before handing it ownership.
    processNimbleHostRunning = false;
    nimble_port_freertos_deinit();
}

bool shutdownProcessControllerObserver() {
    setAcceptingReports(false);
    clearReportQueue();
    processControllerAvailable = false;
    processNimbleSynced = false;
    if (!processControllerInitialized) return true;

    const bool stopRequested = nimble_port_stop() == ESP_OK;
    const std::uint64_t deadlineUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) +
        static_cast<std::uint64_t>(
            BoardBlePassiveScanner::kHostShutdownTimeoutMs) * 1000ULL;
    while (processNimbleHostRunning &&
           static_cast<std::uint64_t>(esp_timer_get_time()) < deadlineUs) {
        vTaskDelay(pdMS_TO_TICKS(1U));
    }
    if (processNimbleHostRunning) return false;
    // Let the host task execute its immediate self-delete before deinitializing
    // the controller/host pools from this worker task on a different core.
    vTaskDelay(pdMS_TO_TICKS(1U));

    const bool deinitialized = nimble_port_deinit() == ESP_OK;
    if (deinitialized) processControllerInitialized = false;
    return stopRequested && deinitialized;
}

bool initializeProcessControllerObserver() {
    if (processControllerInitialized) {
        return processControllerAvailable && processNimbleSynced &&
            ble_hs_synced();
    }
    clearReportQueue();
    setAcceptingReports(false);

    // esp32-hal-alloc-ble-mem.h registers this low-level adapter as a BLE
    // consumer before initArduino(). Without that constructor marker the core
    // permanently releases BLE controller memory before setup(), and the
    // later NimBLE bootstrap enters an invalid controller lifecycle.
    // Arduino-ESP32 3.3.9 is built with NimBLE, not Bluedroid. The Arduino
    // controller-only shortcut enters a lifecycle that crashes on this S3;
    // nimble_port_init() is the framework's supported controller + transport
    // bootstrap. The complete host lifecycle is bounded by one Product Survey
    // run so FAT/SDSPI can mount before and after radio observation without
    // competing for the same internal heap. This adapter never calls
    // advertising, initiating, connecting or active-scan APIs, so no RF-TX operation
    // is reachable from the product observer.
    if (nimble_port_init() != ESP_OK) {
        return false;
    }
    processControllerInitialized = true;

    ble_hs_cfg.reset_cb = handleNimbleReset;
    ble_hs_cfg.sync_cb = handleNimbleSync;
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;
    ble_hs_cfg.sm_bonding = 0U;
    ble_hs_cfg.sm_mitm = 0U;
    ble_hs_cfg.sm_sc = 0U;
    processNimbleSynced = false;
    processNimbleHostRunning = false;
    nimble_port_freertos_init(runProcessNimbleHost);

    const std::uint64_t deadlineUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) +
        static_cast<std::uint64_t>(kNimbleSyncTimeoutMs) * 1000ULL;
    while (!processNimbleSynced &&
           static_cast<std::uint64_t>(esp_timer_get_time()) < deadlineUs) {
        vTaskDelay(pdMS_TO_TICKS(1U));
    }
    if (!processNimbleSynced || !ble_hs_synced()) {
        shutdownProcessControllerObserver();
        return false;
    }
    processControllerAvailable = true;
    return true;
}

}  // namespace

volatile bool BoardBlePassiveScanner::activeScan_ = false;
std::atomic_bool BoardBlePassiveScanner::cancelRequested_{false};

const char* boardBleScanStatusName(BoardBleScanStatus status) {
    switch (status) {
        case BoardBleScanStatus::Valid: return "valid";
        case BoardBleScanStatus::NotStarted: return "not_started";
        case BoardBleScanStatus::InvalidPlan: return "invalid_plan";
        case BoardBleScanStatus::StackInitFailed: return "stack_init_failed";
        case BoardBleScanStatus::ScannerUnavailable:
            return "scanner_unavailable";
        case BoardBleScanStatus::ScanTimedOut: return "scan_timed_out";
    }
    return "unknown";
}

bool BoardBlePassiveScanner::begin() {
    if (initialized_) return true;
    cancelRequested_.store(false, std::memory_order_release);
    cleanupComplete_ = false;
    passiveOnly_ = true;
    clearReportQueue();
    setAcceptingReports(false);

    // Storage admission and its FAT mount have already completed and released
    // their heap. Only passive ble_gap_disc() is exposed by this adapter; no
    // advertising, initiating, connecting or active scanning is representable.
    if (!initializeProcessControllerObserver()) {
        cleanupComplete_ = true;
        return false;
    }
    initialized_ = true;
    return true;
}

BoardBlePassiveScanResult BoardBlePassiveScanner::scan(
    const drivers::ble::BleScanPlan& plan,
    BleRecordVisitor visitor, void* context) {
    BoardBlePassiveScanResult result;
    if (!initialized_) return result;
    if (!drivers::ble::validatePassivePlan(plan) || visitor == nullptr) {
        result.status = BoardBleScanStatus::InvalidPlan;
        return result;
    }

    RawScanContext scanContext;
    scanContext.maximumRecords = plan.maximumRecords;
    scanContext.deduplicateAddresses = plan.deduplicateAddresses;
    scanContext.visitor = visitor;
    scanContext.visitorContext = context;
    scanContext.result = &result;
    const std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    for (std::uint16_t attempt = 1U;
         attempt <= kMaximumScanAttempts; ++attempt) {
        result.attempts = attempt;
        if (cancelRequested_.load(std::memory_order_acquire)) {
            result.status = BoardBleScanStatus::ScanTimedOut;
            break;
        }
        clearReportQueue();
        setAcceptingReports(true);
        const bool started = startPassiveScan(plan);
        if (!started) {
            setAcceptingReports(false);
            activeScan_ = false;
            result.status = BoardBleScanStatus::ScannerUnavailable;
        } else {
            activeScan_ = true;
            const std::uint64_t deadlineUs =
                static_cast<std::uint64_t>(esp_timer_get_time()) +
                static_cast<std::uint64_t>(plan.durationMs) * 1000ULL;
            while (activeScan_ &&
                   !cancelRequested_.load(std::memory_order_acquire) &&
                   static_cast<std::uint64_t>(esp_timer_get_time()) <
                       deadlineUs) {
                drainReports(&scanContext);
                vTaskDelay(pdMS_TO_TICKS(5U));
            }
            drainReports(&scanContext);
            const bool completedWindow = activeScan_;
            const bool disabled = completedWindow ? stopPassiveScan() : true;
            activeScan_ = false;
            setAcceptingReports(false);
            drainReports(&scanContext);
            result.status = completedWindow && disabled &&
                    !cancelRequested_.load(std::memory_order_acquire)
                ? BoardBleScanStatus::Valid
                : BoardBleScanStatus::ScanTimedOut;
        }
        if (result.valid() || attempt == kMaximumScanAttempts) break;
        if (result.status != BoardBleScanStatus::ScannerUnavailable &&
            result.status != BoardBleScanStatus::ScanTimedOut) {
            break;
        }
        increment(&result.transientRetries);
        vTaskDelay(pdMS_TO_TICKS(kRetryDelayMs));
    }
    result.durationUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - startedUs;
    return result;
}

bool BoardBlePassiveScanner::cancelActiveScan() {
    cancelRequested_.store(true, std::memory_order_release);
    if (!activeScan_) return true;
    const bool cancelled = stopPassiveScan();
    activeScan_ = false;
    setAcceptingReports(false);
    return cancelled;
}

bool BoardBlePassiveScanner::processControllerReady() {
    return processControllerAvailable && processNimbleSynced &&
        ble_hs_synced();
}

bool BoardBlePassiveScanner::end() {
    bool complete = cancelActiveScan();
    initialized_ = false;
    activeScan_ = false;
    complete = shutdownProcessControllerObserver() && complete;
    cleanupComplete_ = complete && !processControllerReady() &&
        !processNimbleHostRunning && !processControllerInitialized;
    return cleanupComplete_;
}

}  // namespace leshy1::platform::arduino
